20230302T004627--kdoc-22-whitespaceを読む__project.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-10-28 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 22: whitespaceを読む</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 22: whitespaceを読む</h1>
<p>
whitespaceは、無意味な空白を検知する<a href="20210911113057-go.html#ID-7cacbaa3-3995-41cf-8b72-58d6e07468b1">Go</a>のLinterである。
</p>

<div id="outline-container-org6794cc2" class="outline-2">
<h2 id="org6794cc2"><a href="#org6794cc2">tasks</a></h2>
<div class="outline-text-2" id="text-org6794cc2">
</div>
<div id="outline-container-orgdbb12b9" class="outline-3">
<h3 id="orgdbb12b9"><a href="#orgdbb12b9"><span class="done DONE">DONE</span> どうやって空行を検知しているか</a></h3>
<div class="outline-text-3" id="text-orgdbb12b9">
<p>
仕組み。
</p>

<ul class="org-ul">
<li>関数定義一覧をとる</li>
<li>visitorを作成</li>
<li>walkの引数にvisitorを渡す
<ul class="org-ul">
<li>ast.Walkは探索アルゴリズムを切り替えるときに使う</li>
<li>visitorインターフェースがアルゴリズム</li>
</ul></li>
<li>messagesをスライスに貯める</li>
<li>ループを抜けてmessagesを返却</li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>if文や、関数定義であればチェックを実行して、フラグをつける。フラグは後の本筋の処理で使う。</label><pre class="src src-git-permalink">https://github.com/ultraware/whitespace/blob/a14a2923c0f916b3fc7dbd0238ef85b88f85ef8a/main.go#L63-L73
</pre>
</div>

<pre class="example" id="org29b2821">
if stmt, ok := node.(*ast.IfStmt); ok &amp;&amp; v.settings.MultiIf {
	checkMultiLine(v, stmt.Body, stmt.Cond)
}

if stmt, ok := node.(*ast.FuncLit); ok &amp;&amp; v.settings.MultiFunc {
	checkMultiLine(v, stmt.Body, stmt.Type)
}

if stmt, ok := node.(*ast.FuncDecl); ok &amp;&amp; v.settings.MultiFunc {
	checkMultiLine(v, stmt.Body, stmt.Type)
}
</pre>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>本筋の処理</label><pre class="src src-git-permalink">https://github.com/ultraware/whitespace/blob/a14a2923c0f916b3fc7dbd0238ef85b88f85ef8a/main.go#L75-L95
</pre>
</div>

<pre class="example" id="org469797d">
if stmt, ok := node.(*ast.BlockStmt); ok {
	wantNewline := v.wantNewline[stmt]

	comments := v.comments
	if wantNewline {
		comments = nil // Comments also count as a newline if we want a newline
	}
	first, last := firstAndLast(comments, v.fset, stmt.Pos(), stmt.End(), stmt.List)

	startMsg := checkStart(v.fset, stmt.Lbrace, first)

	if wantNewline &amp;&amp; startMsg == nil {
		v.messages = append(v.messages, Message{v.fset.Position(stmt.Pos()), MessageTypeAddAfter, `multi-line statement should be followed by a newline`})
	} else if !wantNewline &amp;&amp; startMsg != nil {
		v.messages = append(v.messages, *startMsg)
	}

	if msg := checkEnd(v.fset, stmt.Rbrace, last); msg != nil {
		v.messages = append(v.messages, *msg)
	}
}
</pre>

<ul class="org-ul">
<li>check系関数を使って、警告メッセージを格納する</li>
</ul>
</div>
</div>

<div id="outline-container-org1d3ac08" class="outline-3">
<h3 id="org1d3ac08"><a href="#org1d3ac08"><span class="done DONE">DONE</span> オプションはどうやって指定しているか</a></h3>
<div class="outline-text-3" id="text-org1d3ac08">
<p>
オプションを指定しているようだが、どうやっているか。
</p>

<p>
Settings構造体を初期化している箇所はない。呼び出し元の設定で、このコードからはわからない。
</p>
</div>
</div>

<div id="outline-container-org6311c49" class="outline-3">
<h3 id="org6311c49"><a href="#org6311c49"><span class="done DONE">DONE</span> checkMultilineは何をしているか</a></h3>
<div class="outline-text-3" id="text-org6311c49">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>複数行かをチェックして、フィールドのフラグを立てる</label><pre class="src src-git-permalink">https://github.com/ultraware/whitespace/blob/a14a2923c0f916b3fc7dbd0238ef85b88f85ef8a/main.go#L100-L106
</pre>
</div>
</div>
</div>

<div id="outline-container-org0ee3c1a" class="outline-3">
<h3 id="org0ee3c1a"><a href="#org0ee3c1a"><span class="done DONE">DONE</span> 警告部分</a></h3>
<div class="outline-text-3" id="text-org0ee3c1a">
<div class="org-src-container">
<pre class="src src-git-permalink">https://github.com/ultraware/whitespace/blob/a14a2923c0f916b3fc7dbd0238ef85b88f85ef8a/main.go#L138-L149
</pre>
</div>

<pre class="example" id="orgc2360d7">
func checkStart(fset *token.FileSet, start token.Pos, first ast.Node) *Message {
	if first == nil {
		return nil
	}

	if posLine(fset, start)+1 &lt; posLine(fset, first.Pos()) {
		pos := fset.Position(start)
		return &amp;Message{pos, MessageTypeLeading, `unnecessary leading newline`}
	}

	return nil
}
</pre>

<ul class="org-ul">
<li>どうして、posLineの比較でわかるのか
<ul class="org-ul">
<li>実際のコードの位置と、ASTから生成したコードの位置を比較しているぽい</li>
<li>適切であればposは変わらない。余計なwhitespaceがあると、元の位置が大きくなる</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org8584724" class="outline-2">
<h2 id="org8584724"><a href="#org8584724">memo</a></h2>
<div class="outline-text-2" id="text-org8584724">
<ul class="org-ul">
<li>ast.FuncDeclは関数定義</li>
<li>linterじゃないが、キーワードの出現回数とかの統計情報を出せるわけか</li>
<li>関数の一覧
<ul class="org-ul">
<li>長さ</li>
<li>行数</li>
<li>並び替え</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
